Revit 2027 API
BuiltInFailures.StairRampFailures.StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure Property
 Only single boundary case may have riser with its both ends on boundary.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure { get; }
Public Shared ReadOnly Property StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure {
	FailureDefinitionId^ get ();
}
static member StairsOnlySingleBoundaryHasRiserWithBothEndsOnBoundaryFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace